import math

# Зчитуємо координати точок A і B з клавіатури

x1 = float(input("Введіть координату x1: "))

y1 = float(input("Введіть координату y1: "))

x2 = float(input("Введіть координату x2: "))

y2 = float(input("Введіть координату y2: "))

# Обчислюємо кути, які утворюють відрізки OA і OB з віссю OX

angle_A = math.atan2(y1, x1)

angle_B = math.atan2(y2, x2)

# Перевіряємо, який відрізок утворює більший кут

if angle_A > angle_B:

    print("Відрізок OA утворює більший кут з віссю ОХ")

else:

    print("Відрізок OB утворює більший кут з віссю ОХ")

